Tekla Open API Reference for Tekla Structures 2025
AnalysisEdge.GetSplitPositions Method
 Gets the split positions of the analysis edge.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetSplitPositions()
Public Function GetSplitPositions As AnalysisObjectEnumerator
Return Value
Type: AnalysisObjectEnumerator
The split positions of the analysis edge.
See Also
Reference
AnalysisEdge Class
Tekla.Structures.Analysis Namespace